Repository: vrk-kpa/ckanext-apis
Catalog: ckanext/apis/i18n/*/LC_MESSAGES/ckanext-apis.po
Languages: fi

source: Yes
fi: Kyllä

source: No
fi: Ei

source: eg. my-apis
fi: esim. my-apis

source: eg. A detailed description
fi: Kirjoita kuvaus rajapinnasta

source: eg. Maps
fi: esim. kartat

source: My organization
fi: Minun organisaationi

source: Title of the API collection
fi: Rajapinnan nimi

source: Description for the API collection
fi: Rajapinnan kuvaus

source: Keywords and categories
fi: Avainsanat ja kategoriat

source: Other information
fi: Muut tiedot

source: Provider and maintainer of the API collection
fi: Rajapinnan tuottaja ja ylläpitäjä

source: Name of the API
fi: Rajapinnan nimi

source: API file or link
fi: Linkki rajapintaan tai dokumentaatioon

source: API user guide
fi: Rajapinnan käyttöohje

source: * Required field
fi: * Pakollinen kenttä

source: <a href="https://www.avoindata.fi/fi/kayttoohjeet/rajapinnan-lisaaminen" target="_blank">Instructions on how to add APIs</a>
fi: <a href="https://www.avoindata.fi/fi/kayttoohjeet/rajapinnan-lisaaminen" target="_blank">Lue ohjeet rajapintojen lisäämiseen</a>

source: API name
fi: Rajapinnan nimi

source: e.g. Suomi.fi Finnish Service Catalogue API
fi: esim. Suomi.fi-palvelutietovarannon API

source: API description
fi: Rajapinnan kuvaus

source: Give a short and descriptive name for the API. For example, Turku geospatial API (WFS)
fi: Nimeä rajapinta lyhyesti ja kuvaavasti. Esimerkiksi Turun paikkatietorajapinta (WFS)

source: Write a description for API.
fi: Kirjoita kuvaus rajapinnalle

source: Describe: <ul><li>What kind of data is available through the API?</li><li>How can the API be used?</li><li>How can you get access to the API?</li><li>Where can you find more information about the API?</li></ul>
fi: Kuvaile: <ul><li>Millaista dataa rajapinnan kautta on saatavilla?</li><li>Millaisiin käyttötarkoituksiin rajapintaa voi käyttää?</li><li>Miten rajapintaan saa pääsyn?</li><li>Mistä löytää lisää tietoa rajapinnasta?</li></ul>

source: API maintainer
fi: Rajapinnan ylläpitäjä

source: Give the name of the organisation or department that is responsible for maintaining the API.
fi: Anna organisaation tai organisaatioyksikön nimi, joka ylläpitää rajapintaa.

source: e.g. Finnish Digital Agency
fi: esim. Digi- ja väestötietovirasto

source: API maintainer email
fi: Rajapinnan ylläpitäjän sähköpostiosoite

source: Enter the email address of the organisation's customer service, not an email address of an individual.
fi: Kirjoita organisaation asiakastuen sähköpostiosoite ei yksityishenkilön sähköpostiosoitetta, jotta sähköposti pysyy toimivana myös henkilöstömuutoksien jälkeen.

source: e.g. opendata@dvv.fi
fi: esim. avoindata@dvv.fi

source: API visibility on Suomi.fi Open Data
fi: Rajapinnan näkyvyys Suomi.fi-avoindatassa

source: You can set the visibility to private temporarily, for example if the API is still missing some information. Private APIs can only be viewed by the members of the organisation that provides the API.
fi: Voit asettaa rajapinnan näkyvyyden väliaikaisesti yksityiseksi esimerkiksi puutteellisten tietojen vuoksi. Yksityiset rajapinnat näkyvät kaikille rajapinnan julkaisseen organisaation kirjautuneille jäsenille.

source: API publisher
fi: Rajapinnan tuottaja

source: Select the organisation that provides the API.
fi: Valitse rajapinnan tarjoava organisaatio.

source: License for the data provided by the API
fi: Rajapinnan kautta tarjotun datan lisenssi

source: Select how the data that is available through the API is licensed. Use a <a href="https://creativecommons.org/licenses/by/4.0/deed.en" target="_blank">CC BY 4 license</a> if you want your organisation to be credited when someone uses your data. Use a <a href="https://creativecommons.org/publicdomain/zero/1.0/deed.en" target="_blank">CC0 license</a> if you want to give up all copyright.
fi: Valitse, miten rajapinnan tarjoama data on lisensoitu. Käytä <a href="https://creativecommons.org/licenses/by/4.0/deed.fi" target="_blank">CC BY 4 lisenssiä </a>, jos haluat, että organisaatiosi nimetään kun joku hyödyntää dataasi. Käytä <a href="https://creativecommons.org/publicdomain/zero/1.0/deed.fi" target="_blank">CC0 lisenssiä</a>, jos haluat luopua kaikista käyttöoikeuksista dataasi.

source: Keywords
fi: Avainsanat

source: Select at least one keyword relating to your data that helps users to find your API.
fi: Kirjoita ainakin yksi dataasi liittyvä avainsana, joka auttaa hyödyntäjiä löytämään rajapinnan.

source: e.g. maps
fi: esim. kartat

source: API access rights
fi: Rajapinnan käyttöehdot

source: Describe the possible restrictions in the use of the API and the pricing. For example, who can access the API, does the API require an API key, and where can users find it. Provide a link to the terms of service and to the possible service-level agreement (SLA) of the API.
fi: Kuvaile mahdollisia rajoitteita rajapinnan käytössä sekä hinnoittelua. Esimerkiksi, kuka voi saada pääsyn rajapintaan, tarvitseeko rajapinnan käyttö API-avaimen ja mistä avaimen voi saada. Lisää linkki rajapinnan käyttöehtoihin ja mahdolliseen palvelutasosopimukseen (SLA).

source: E.g. a link to the terms of service
fi: Esim. linkki käyttöehtoihin

source: Resource name
fi: Rajapinnan resurssin nimi

source: e.g. Finnish Service Catalogue OpenAPI description
fi: esim. Palvelutietovarannon OpenAPI-kuvaus

source: Give the resource a descriptive name. For example, Turku geospatial API OpenAPI description
fi: Anna resurssille kuvaava nimi. Esimerkiksi Turun paikkatietorajapinnan OpenAPI-kuvaus tai Turun wfs-paikkatietorajapinnan osoite (endpoint)

source: Link to an API endpoint or API documentation
fi: Rajapinnan osoite (endpoint) tai linkki rajapinnan dokumentaatioon

source: Add a link to an API endpoint or API documentation, for example OpenAPI. You can also add more information about the API as a pdf-file.
fi: Lisää linkki rajapinnan osoitteeseen (endpoint) tai rajapinnan dokumentaatioon, esimerkiksi OpenAPI. Voit myös lisätä lisätietoja rajapinnasta pdf-tiedostona.

source: API data format
fi: Rajapinnan tarjoaman tiedon tiedostomuoto

source: Add the supported response formats.
fi: Lisää tiedostomuodot, joissa rajapinta tarjoaa tietoa.

source: Technical API description
fi: Rajapinnan tekninen kuvaus

source: Write a technical description for the API.
fi: Kirjoita tekninen kuvaus rajapinnalle

source: Describe:<ul><li>What kind of data the API returns?</li><li>Which version of the API is in use?</li><li>Where can you find the technical documentation for the API?</li></ul>
fi: Kuvaile:<ul><li>Missä muodossa rajapinta palauttaa dataa?</li><li>Mikä versio rajapinnasta on käytössä?</li><li>Mistä löytää rajapinnan teknisen dokumentaation?</li></ul>

source: Does the API require registration?
fi: Vaatiiko rajapinnan käyttö rekisteröitymisen?

source: If your API requires registration, describe the registration process in the Description field.
fi: Jos rajapinnan käyttö vaatii rekisteröitymisen, kuvaile rekisteröitymisprosessi Kuvaus-kentässä.

source: User not authorized to edit {id}
fi: Käyttäjällä ei ole oikeutta muokata {id}

source: Organizations
fi: Organisaatiot

source: Tags
fi: Avainsanat

source: Licenses
fi: Lisenssit

source: Apiset not found
fi: Rajapintaa ei löytynyt

source: Unauthorized to read apiset
fi: Ei oikeuksia lukea rajapintaa

source: User not authorized to edit {apiset_id}
fi: Käyttäjällä ei ole oikeutta muokata {apiset_id}

source: The dataset has been removed from the apiset.
fi: Rajapintaan liitetty tietoaineisto on poistettu rajapinnan sivulta.

source: The dataset has been added to the apiset.
fi: Tietoaineisto liitettiin rajapintaan.

source: User %r not authorized to edit %s
fi: Käyttäjällä %r ei ole oikeutta muokata %s

source: Unauthorized to read apiset %s
fi: Ei oikeuksia lukea rajapintaa %s

source: Unauthorized to delete apiset %s
fi: Ei oikeutta poistaa rajapintaa %s

source: Apiset has been deleted.
fi: Rajapinta on poistettu.

source: Not found
fi: Ei löytynyt

source: Dataset
fi: Tietoaineisto

source: Are you sure you want to delete apiset - {name}?
fi: Haluatko varmasti poistaa rajapinnan - {name}?

source: Apisets
fi: Rajapinnat

source: Edit
fi: Muokkaa

source: Create Apiset
fi: Lisää rajapinta

source: View apiset
fi: Tarkastele rajapintaa

source: Edit apiset
fi: Muokkaa rajapintaa

source: Apiset resources
fi: Resurssit

source: Link datasets
fi: Liitä tietoaineistoja

source: Apiset - Manage datasets
fi: Rajapinnat - Liitä tietoaineistoja

source: You can link the datasets the API provides to the API. The added datasets are shown on API's page. Please note that you have to add the dataset to our service before you can link it to an API
fi: Voit liittää rajapinnan tarjoamat tietoaineistot rajapintaan. Liitetyt tietoaineistot näytetään rajapinnan sivulla. Huomioi, että sinun täytyy lisätä tietoaineisto palveluun ennen kuin voit liittää sen rajapintaan.

source: Datasets provided by the API
fi: Rajapinnan tarjoamat tietoaineistot

source: Remove from Apiset
fi: Poista rajapinnasta

source: This apiset has no datasets associated to it
fi: Rajapintaan ei ole liitetty tietoaineistoja

source: Search and add datasets to an apiset
fi: Hae tietoaineistoja ja liitä ne rajapintaan

source: Relevance
fi: Osuvin ensin

source: Name Ascending
fi: Nimen mukaan nousevasti

source: Name Descending
fi: Nimen mukaan laskevasti

source: Last Modified
fi: Viimeksi muokattu

source: Popular
fi: Suosittu

source: Add to Apiset
fi: Liitä rajapintaan

source: No datasets could be found
fi: Tietoaineistoja ei löytynyt

source: Title
fi: Nimi

source: eg. A descriptive title
fi: esim. kuvaava otsikko

source: eg. my-apiset
fi: eg. my-api

source: Description
fi: Kuvaus

source: eg. Some useful notes about the data
fi: esim. huomioita aineistosta

source: eg. economy, mental health, government
fi: esim. talous, mielenterveys, hallinto

source: External link
fi: Ulkoinen linkki

source: http://www.example.com
fi: https://www.example.com

source: Submitted By
fi: Ilmoittaja

source: Submitter Email
fi: Ilmoittajan sähköpostiosoite

source: Are you sure you want to delete this apiset?
fi: Haluatko varmasti poistaa rajapinnan?

source: Delete
fi: Poista

source: Update Apiset
fi: Päivitä rajapinta

source: Abort
fi: Keskeytä

source: Create Showcase
fi: Luo sovellus

source: By submitting this form, you agree to release the <i>metadata</i> values that you enter into the form under the <a href="http://opendatacommons.org/licenses/odbl/1-0/">Open Database License</a>.
fi: Lähettämällä tämän lomakkeen suostut julkaisemaan täyttämäsi metatiedot <a href="https://creativecommons.org/publicdomain/zero/1.0/deed.fi">Creative Commons CC0 1.0 -lisenssin</a> mukaisesti.

source: From the dataset abstract
fi: Tietoaineiston yhteenvedosta

source: Source: <a href="%(url)s">%(dataset)s</a>
fi: Lähde: <a href="%(url)s">%(dataset)s</a>

source: API User Guide
fi: Rajapinnan käyttöohje

source: Additional Information
fi: Lisätiedot

source: Last updated
fi: Viimeksi päivitetty

source: unknown
fi: tuntematon

source: Created
fi: Luotu

source: Format
fi: Muoto

source: License
fi: Lisenssi

source: Add new resource
fi: Lisää uusi resurssi

source: <p class="empty">This dataset has no data, <a href="%(url)s">why not add some?</a></p>
fi: <p class="empty">Rajapintaan ei ole lisätty dataa. <a href="%(url)s">Haluaisitko lisätä rajapinnalle resurssin?</a>

source: Add Apiset
fi: Lisää rajapinta

source: Search apisets...
fi: Etsi rajapintoja...

source: {number} apiset found for '{query}'
fi: {number} rajapinta löydetty haulla '{query}'

source: No apisets found for '{query}'
fi: Haulla "{query}" ei löytynyt rajapintoja

source: {number} apiset found
fi: Löytyi {number} rajapinta

source: No apisets found
fi: Rajapintoja ei löytynyt
